5baimian/Embedded_Code/KEIL Program/STM32/4-1OLED显示屏/Hardware/LED.c
#include "stm32f10x.h"                  // Device header
/**
  * @brief  初始化LED驱动模块，配置各个输出引脚
  * @param 无
  * @retval 无
  */
void LED_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_1|GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	//GPIO_SetBits(GPIOA,GPIO_Pin_1|GPIO_Pin_2);//亮
	//GPIO_ResetBits(GPIOA,GPIO_Pin_1|GPIO_Pin_2);//灭
}

void LED1_ON(void)
{
	GPIO_SetBits(GPIOA,GPIO_Pin_1);//亮
}

void LED1_OFF(void)
{
	GPIO_ResetBits(GPIOA,GPIO_Pin_1);//灭
}

void LED1_Turn(void)
{
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_1)==0)
	{
		GPIO_SetBits(GPIOA,GPIO_Pin_1); 
	}
	else
 {
			GPIO_ResetBits(GPIOA,GPIO_Pin_1); 

 }
}

void LED2_ON(void)
{
	GPIO_SetBits(GPIOA,GPIO_Pin_2);//亮
}

void LED2_OFF(void)
{
	GPIO_ResetBits(GPIOA,GPIO_Pin_2);//灭
}
/**
  * @brief  实现灯的亮灭
  * @param 无
  * @retval 无
  */
void LED2_Turn(void)
{
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_2)==0)
	{
		GPIO_SetBits(GPIOA,GPIO_Pin_2); //liang
	}
	else
 {
			GPIO_ResetBits(GPIOA,GPIO_Pin_2); //灭

 }
}
